{
  "upload-file": "Cargar archivo",
  "upload-description": {
    "0": "La calidad del modelo está en el centro de los proyectos BIM exitosos.",
    "1": "El objetivo de esta herramienta es proporcionar una verificación rápida del estado general de un modelo. Viene con un par de pruebas estándar; si tienen éxito, vale la pena profundizar en el modelo.",
    "2": "De lo contrario probablemente no.",
    "3": "Lo diseñamos para ser realmente fácil y seguro.",
    "4": "Todos los datos permanecen en su máquina local: no se enviarán datos a ninguna parte, todas las comprobaciones se realizan localmente"
  },
  "upload-card": {
    "title": "Validación de modelos y reglas",
    "description": "IFC Model Checker señala problemas comunes en archivos .ifc, lo que genera datos de alta calidad en la industria AEC. La verificación de los archivos IFC cargados se realiza completamente en el lado del cliente, no guardamos ningún dato: nada sale de su dispositivo y todo se elimina después de cerrar la sesión.",
    "rules": "Reglas:",
    "info-card": {
      "0": "Validación del nombre del proyecto: garantiza que cada proyecto tenga un nombre válido y significativo.",
      "1": "Asociaciones de proyectos: verifica que todos los elementos relacionados con el proyecto estén vinculados correctamente.",
      "2": "Validación del nombre del sitio: confirma que los nombres del sitio están definidos correctamente.",
      "3": "Asociaciones de sitios: comprueba la vinculación adecuada de los elementos relacionados con el sitio.",
      "4": "Validación del nombre del edificio: garantiza que los edificios dentro del proyecto tengan nombres claros y válidos.",
      "5": "Asociaciones de edificios: valida las conexiones entre edificios y otros elementos.",
      "6": "Validación del piso del edificio: confirma que cada edificio tiene una estructura de piso válida.",
      "7": "Validación del nombre de la planta: Garantiza que cada planta o piso dentro de un edificio tenga el nombre correcto.",
      "8": "Asociaciones de pisos: verifica que los elementos estén asociados adecuadamente con sus respectivos pisos.",
      "9": "Validación del nombre del espacio: garantiza que todos los espacios tengan nombres claros y precisos.",
      "10": "Validación del nombre del objeto: confirma que todos los objetos del proyecto tienen nombres válidos.",
      "11": "Validación de descripción de objeto: garantiza que cada objeto tenga una descripción adecuada.",
      "12": "Validación de nombre de tipo: Verifica que los tipos estén nombrados correctamente, evitando ambigüedades.",
      "13": "Asociaciones de materiales: garantiza que todos los objetos tengan definiciones de materiales asociadas.",
      "14": "Verificación de tipo predefinido: confirma que los tipos predefinidos son válidos (no UNDEFINED).",
      "15": "Validación de elementos: identifica la existencia de BuildingElementProxies."
    }
  },
  "validate": "Validar",
  "dropzone": {
    "drag": "Arrastre los archivos IFC aquí o haga clic para seleccionar archivos",
    "attach": "Adjunte tantos archivos como desee, cada archivo no debe exceder los 500 Mb",
    "error": "Tipo de archivo invalido. Sólo se permiten archivos .ifc.",
    "error-message": "Archivo"
  },
  "results": "Resultados",
  "print": "Imprimir",
  "result-table": {
    "rule": "Regla",
    "status": "Estatus",
    "level-of-fulfilment": "Nivel de cumplimiento",
    "passed": "Aprobado",
    "failed": "Fallido",
    "statistics": "Estadísticas",
    "all-data": "Todos los datos",
    "count": "Cantidad",
    "other": "Otro"
  },
  "rules": {
    "project-name": "¿Se ha completado el nombre del proyecto Ifc?",
    "site-name": "¿Se completó el nombre del sitio Ifc?",
    "building-name": "¿Se ha completado el nombre del edificio Ifc?",
    "story-name": "¿Se han completado los nombres de las plantas de IfcBuilding?",
    "story-relation": "¿Todos los objetos tienen una relación con un BuildingStory?",
    "building-relation": "¿Todos los objetos tienen una relación con un edificio?",
    "site-relation": "¿Todos los Objetos tienen una relación con un Sitio?",
    "project-relation": "¿Todos los Objetos tienen una relación con un Proyecto?",
    "space-name": "Si hay IfcSpaces, ¿tienen el Nombre completo?",
    "object-name": "¿Todos los objetos tienen un nombre?",
    "type-name": "¿Todos los objetos tienen un nombre de tipo?",
    "object-description": "¿Todos los objetos tienen una descripción?",
    "material-name": "¿Todos los objetos tienen un nombre de material?",
    "predefined-type": "Si los Objetos tienen un Tipo Predefinido, ¿están definidos?",
    "object-count": "Porcentaje de IfcBuildingElementProxy utilizado:",
    "project-names": "Nombre del Proyecto IFC utilizado",
    "site-names": "Nombre del Sitio IFC utilizado",
    "building-names": "Nombre del Edificio IFC utilizado",
    "story-names": "Nombres de pisos utilizados",
    "object-names": "Nombres de objetos IFC utilizados",
    "type-names": "Nombre del tipo de objeto IFC utilizado",
    "descriptions": "Descripción del objeto IFC utilizado",
    "material-names": "Nombre del material del objeto IFC utilizado",
    "predefined-types": "Tipo predefinido de objeto IFC utilizado",
    "building-element-proxies": "¿Todos los BuildingElementProxy tienen un nombre?"
  },
  "sponsored-by": "Creado por:",
  "open-source": "Código abierto en:",
  "author": "Autor",
  "exported": "Exportado"
}
